Repository: atlas-studios/Session2-G9
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 死亡之心通常只在死气浓郁的地方生长，越浓郁的死气，也就越容易孕育出死亡之心，有死亡之心生长的地方，通常也就有高等级的亡灵生物出没，而且在孕育出来之后，死亡之心还需要借助诅咒之力才能生长，而黄昏诅咒，就正好是有可能出滋生死亡之心的几种诅咒之一。
en_us: The Heart of Death usually grew only in places with strong death aura. The stronger the death aura, the easier it was for the Heart of Death to spawn. The places where the Heart of Death grew would usually be haunted by high-level undead creatures. After it spawned, the Heart of Death would need the power of a curse to grow, and the Twilight Curse was one of the several curses that could breed the Heart of Death.

source: 每一步都预先算好了，可偏偏每一步都出了差错。
en_us: He had counted every step beforehand, but it just happened that all the steps had gone wrong.

source: 每只椰子砸在身上，林立都感觉象是被炮弹射中似的。
en_us: Lin Li felt as if he was being shot by a cannonball every time a coconut landed on his body.

source: 每天一大早林立就直奔图书馆，他有太多的知识需要恶补，坐在安静的图书馆里，林立感觉自己好象又回到了高考之前，好不容易从书堆中抬起头来，他经常是连饭都顾不上吃，就又回到了药剂室里，在那里，有价值数千金币的草药在等着他。
en_us: Every morning, Lin Li would head straight to the library. He had too much knowledge that needed catching up with. Sitting in the quiet library, Lin Li felt as if he was back to the time before his college entrance examination. When he had finally looked up from the pile of books, he'd often go back to the potion lab without having his meals. There, herbs worth thousands of gold coins were waiting for him.

source: 每天拼命的练习元素排列，确实让林立对魔法元素的掌握到了一个很高的水准，他甚至可以瞬发出二级魔法冲击水幕，这可是很多十级以上的魔导士都无法完成的事，拼命的阅读各种魔法书籍，也让他渐渐摆脱了二手魔法师这个尴尬的身份，至少很多时候，他都不用一遇到什么事就找凯文询问了。
en_us: The daily practice of elemental sequencing had indeed brought Lin Li's mastery of magical elements to a high level. He could even unleash the level-two Waterfall Strike instantaneously, something which many archmages above level-ten were not able to accomplish. Reading all kinds of magic books desperately had also allowed him to be gradually rid of the awkward status of a novice mage, becoming a full-fledged one instead; at least most of the time now he didn't have to ask Kevin about everything when he had encountered problems.

source: 每次化丹柳长老都亲自动手的，用强大火红色元力，把里面的药汁分化融炼成丹药。他看到柳长老如此强大实力炼制一炉丹都满头大汗的，他这点实力暂时想都别想了……
en_us: Every time they reached the second step, Elder Liu took up the mantle himself to form the elixirs, by using powerful fiery-red essence force to melt down and process the medicinal juices in the cauldron into elixirs. Seeing Elder Liu, with his immensely strong power, produce buckets of sweat on his head as he refined a cauldron of elixirs, Jiang Yi realized he should temporarily forget about doing the same with what little power he had...

source: 每次通过水晶球偷窥完，安度因都会觉得，这小子怎么又有些陌生了……
en_us: Each time he peeked through the crystal ball to observe Lin Li’s battles with the creatures, Andoine always felt that Lin Li felt distant and unfamiliar again…

source: 比如什么上次拍卖会走得太急，还没来得及跟费雷魔法师打个招呼，真是有些过意不去云云……
en_us: Matters such as he had left in a hurry at the last auction and didn't have the time to say hello to Mage Felic, and that he was sorry about it...

source: 比如当江逸修炼水系功法江水决时，产生的元力是蓝色的，而他以前修炼也曾修炼过火系的烈焰决，那套功法产生的元力则是红色的。
en_us: For instance, when Jiang Yi practiced channeling water-element abilities through the Jiang Water Art, the essence force produced was blue; as for the Wildfire Art he had practiced when he was younger, the essence force produced was red.

source: 比如江逸修炼的江水决，就是人阶上品，比如他在江家学会的最高等级的武技“幻影拳”也是人阶上品的。
en_us: For instance, the Jiang Water Art practiced by Jiang Yi was classified as Man-tier superior grade; the highest level martial art technique "Phantom Fist" that he had learned from the Jiang Clan was also classified as Man-tier superior grade.

source: 比如江逸目前是铸鼎境一重，大致拥有一马之力，可开一石之弓，约等同于四钧一百二十斤力气。而身为铸鼎境二重的江豹呢，则大致拥有两马之力，也就是八均二百四十斤力气。
en_us: An average person at the first stage of the Cast Tripod Realm usually had the power of a horse. They could break a rock with a single blow and could lift 72 kilograms. Jiang Bao, a second-stage Cast Tripod Realm martial artist, had the power of two horses and could lift 144 kilograms.

source: 比如深邃之银项链的前主人，那位罗林家族族长，他也在这场宴会当中，当林立看见他的时候，他身上旁已经围了至少五六名宾客，此时正露骨的向他献着殷勤。
en_us: For example, the previous owner of the deep silver necklace, the patriarch of the Rolin Family, was present at the banquet as well. When Lin Li spotted him, he was already surrounded by at least five or six guests blatantly flattering him.

source: 比起充满神秘华丽的镀金玫瑰来，冒险者公会背后的黑市简直就是另一个世界。
en_us: The black market behind the Adventurers Guild was an entirely different world from the mysterious and elegant Gilded Rose.

source: 比起熙熙攘攘的冒险者公会来，翡翠之塔下异常安静，林立站在大门之外，竟是许久也没听见一丝声音，只有一股淡淡的魔法波动从塔内传出，这股魔法波动让林立觉得威严而神秘，就好象自己面对着的，是一座不可逾越的高山一般。
en_us: The Emerald Tower was unusually quiet as compared to the bustling Adventurers Guild. Lin Li stood outside the gate for long but did not hear a sound at all. There was only a faint wave of magic coming from the tower. The magical wave was majestic and mysterious, and it made Lin Li feel as if what he was facing was an insurmountable mountain.

source: 毕竟一个才接触魔法几个月，而另一个却已经在魔法上花费了十几二十年的时间。
en_us: After all, one had just been exposed to magic for a few months, while the other had already spent over 20 years on magic.

source: 毫不夸张的说一句，只要有林立在魔法公会，就没有哪一个魔法师舍得离开。
en_us: It was no exaggeration to say that as long as Lin Li was in the Guild of Magic, no mage would be willing to leave.

source: 气急败坏的怒吼声尚未落下，就听见“蓬”的一声闷响从门外传来，跟着就是一阵浓烟弥漫，刺鼻的药味透过门缝飘进，又一次熏得林立睁不开眼来，紧接着虚掩的房门被人猛的推开，老头根本不顾自己被炸得满头是包，冲进门来就一把抓住林立：“说！你为什么知道它会炸？”
en_us: The angry roar had yet to die down when a muffled sound of explosion was heard from behind the door. A cloud of smoke followed and the pungent smell of medicine wafted through the door’s cracks, and Lin Li found it hard to open his eyes again. Then the door was flung open and the old man rushed in, completely ignoring that his head was covered in bruises from the explosion. He grabbed Lin Li and demanded, "Speak! How did you know it would explode?"

source: 水晶灯依旧散发着柔和的灯光，耳边响起的音乐依旧舒缓轻柔。
en_us: The crystal chandeliers still emitted the soft light, and the music still sounded soothing and gentle in the ears.

source: 水晶球完全没有动静，只能说明屠魔山谷的战斗，远比凯文带来的消息更加激烈。
en_us: The fact that the crystal ball was completely silent only meant that the battle in the Demon Fall Valley was far more intense than in the news Kevin received.

source: 水晶球散发出的光芒，证实了凯文先前的猜测，林立如今的魔法等级，确实已经突破了九级，甚至已经达到了九级的颠峰。
en_us: The glow from the crystal ball confirmed Kevin's earlier speculations. Lin Li's magic level had indeed gone beyond level-nine, and had even reached the peak of level-nine.

source: 水晶笔中间是空的，笔尖上布满了细密的纹路，林立将它伸进星辰墨水当中，轻轻一蘸，那浓稠的龙血墨水，立刻就顺着笔尖上的纹路流入，很快灌满了笔心。
en_us: The center of the crystal pen was hollow and the tip was covered with fine lines. Lin Li dipped it into the star ink. The thick dragon's blood ink flowed along the lines from the tip of the pen and quickly filled the pen lead.

source: 永恒精金可是好东西，天生的稳定属性，造就了它绝佳的元素防护能力，除了用来锻造点金棒之外，还常常用在铠甲锻造上面，象一般的战士铠甲，只要薄薄的镀上一层永恒精金，立刻就能将它的魔法防御力提升一个层次。
en_us: Eternal Adamantine was good stuff. It had exceptional elemental defense abilities due to its natural attribute of stability, which rendered it useful in the forging of gold rods and, often times, armor. Take for instance, the magical defense capacity of an average warrior armor would be upped by a level instantly with just a thin layer of Eternal Adamantine.

source: 永恒精金号称世界上最稳定的金属，以它为材料锻造的点金棒，最低限度也可以将附魔成功率提升百分之十以上！
en_us: The Eternal Adamantine was known as the most stable of all metals in the world. A gold rod forged from it could also increase the success rate of enchantment by at least ten percent!

source: 永恒精金天生属性稳定，完全无法通过魔法进行探测，就算是林立这个矿物大师，也只有等到晚上，天色完全暗下来之后，才能凭借着永恒精金在夜晚之时，所散发出的独特光芒进行判断。
en_us: Due to its naturally stable attributes, it was totally impossible to detect Eternal Adamantine through magic. Even Lin Li himself, the Master of Minerals, had no other choices but to wait until nightfall so as to identify Eternal Adamantine based on its unique glow in complete darkness at night.

source: 永恒精金矿脉里，除了出产安眠水晶之外，还常常能够采到一些稀有宝石，比龙眼宝石，大地之心，星辰悲歌之流，这些可都是真正的稀有宝石，即便是其中质量最差的，也绝不会比霍伦戒指上的红宝石逊色。
en_us: In the mineral veins of Eternal Adamantine, in addition to Hypnotic Crystals, rare gemstones such as Dragon's Eye, Heart of Earth and Star Elegy could often be found as well. Those were genuine rare gemstones, even the worst of which were on par with, if not better than, the ruby on Hoeren's ring.

source: 江如虎一直在偷偷观察情况，看到江如狼也被击飞后再也不敢看了，身子一缩偷偷朝侧门溜去，江如龙还没来，他还不跑下场唯有和地上江豹江松一样了。
en_us: Jiang Ruhu had been observing the situation all this time. After seeing Jiang Rulang got blasted off, he didn't dare continue watching anymore. He shrank his body and stealthily slipped towards the side door. Jiang Rulong had yet to arrive, if he still didn't escape, he would end up in the same state as Jiang Bao and Jiang Song on the floor.

source: 江如虎不是蠢货，否则也不会成为这群人的老大了，他嘴角露出一抹意味深长的微笑，快速和一名铸鼎境三重旁系子弟江如鹰对视一眼，给他打了一个眼色，这才转头和江逸点头道：“那是自然，我江如虎的话一言九鼎，你只要从我们胯下逐一爬过，保证以后见我们绕道而行，我就放你一马。如鹰，摆马步吧！”
en_us: Jiang Ruhu was no idiot - otherwise, how could he have possibly become the leader of this group of men? From the corner of his mouth came a faint smile filled with profound hidden meanings and intentions. He quickly turned to exchange glances with collateral descendant Jiang Ruying, whose power level was at the third stage of the Cast Tripod Realm. Only after giving Jiang Ruying a hidden signal with his eyes, did Jiang Ruhu turn his head and nodded at Jiang Yi, replying, "Naturally, I, Jiang Ruhu, speak words of enormous weight. So long as you crawl between all of our legs and under our groins, I will guarantee that the next time we cross paths, I will let you pass unharmed. Ruying, position yourself in the horse stance!"

source: 江如虎双眼失明，双手和一条腿被踢断，此刻感觉整个人飞了起来，被江逸抡起当做一根木棍般抡起乱扫，脑袋还两次从地面上擦过顿时气疯了，当着如此多小弟这么狼狈，他这个老大还怎么当？
en_us: Jiang Ruhu was blind in both eyes, had both his hands and legs broken by kicking; and worst of all, at that moment he could feel his entire body flying around as Jiang Yi swung him around in a random sweeping motion like a wooden stick, with his head even brushing past the ground twice. He immediately flew into a wild rage - how could he continue being a boss to all these familial subordinates, if he continued being in such a sorrt state in front so many of them?

source: 江如虎双眼暂时失明，眼中还一阵火辣如烈火灼烧，一听幻影拳心彻底沉了下来，本还想抵挡一下，此刻只能胡乱挥舞双臂在上方一阵乱砸了，护住脑袋。
en_us: Jiang Ruhu became temporarily blind in both his eyes; additionally, he felt a scorching sensation of agony burning like a raging inferno in his eyes. Upon hearing the incoming Phantom Punch attack, his heart sank completely. Initially he had thought of withstanding the attack; yet at that moment all he could do was to recklessly brandish both his arms and hitting the air above him in a random manner, in an effort to protect his own head.

source: 江如虎很快就冷笑起来，对着丹房大喝一声：“好，一言为定，十日之后，谁不去谁是孙子。”说完匆匆朝外面奔去，追赶已走了很远的江恨水而去。
en_us: Jiang Ruhu very quickly started laughing coldly. "Very well!" he shouted as he left. "A promise is a promise! Ten days later, whoever isn't there will be the other's grandchild!" Finishing his sentence, he hastily ran out of the building to catch up with Jiang Henshui who had already walked a long distance away.

source: 江如虎想死的心都有了，身体内剧烈的疼痛都让他麻木了，他的脑袋也晕了。这都不算什么，最让他感到屈辱的是，他一个大活人被人如此抡着，还是当着如此多人的面，又被抡了两次了，他以后算是彻底在江家抬不起头了。
en_us: Jiang Ruhu had already prepared to die, the intense pain within his body numbed his senses and his brain was in a dazed state of mind too. All those didn't matter, the thing he was most ashamed of, was to be whirled around like a human sack. This was the second time he got whirled in front of so many people. How would he still lift his head in the Jiang Clan?

source: 江如虎满脸横肉的脸却凑了过来，压低声音冷笑道：“哼，江逸！你有种一辈子永远在这炼丹房做缩头乌龟，你敢出江家大院，我保证让你爬着回来。”
en_us: Jiang Ruhu rushed over to him with a fierce look on his face, laughing coldly in a low voice as he said, "Hmph, Jiang Yi! If you have the guts, stay in this alchemy lab forever, you coward. If you ever dare to leave the central court, I will guarantee that you'll come back crawling."

source: 江如虎的声音断断续续的传来，众人满脸迷茫，这江如虎难道伤到脑袋了？自己都被打成这样了，还要帮江逸隐瞒？
en_us: Jiang Yi's voice stammered out in dribs and drabs. All had a perplexed look on their faces - could it be that Jiang Ruhu's brain was injured as well? He himself had already been beaten to such a pathetic state, yet how could it be that he still wanted to help hide Jiang Yi's secrets?

source: 江如虎看到江逸紧张得全身都绷紧起来，心里莫名感到一阵快意，如一群老虎戏耍一只猴子般有趣。他丹田内的元力悄然运转，一脸的横肉抖动起来，气势汹汹缓缓朝江逸走去，爆喝起来：“早知道怕，就别动我的人，现在……晚了！不过，虎爷我今日心情好就给你一个机会，只要你从我们所有人胯下爬过去，今日我们就放你一马，如何？”
en_us: Upon seeing Jiang Yi become so nervous that his entire body started becoming taut, Jiang Ruhu felt an indescribable burst of elation in his heart. It was so interesting, akin to a pack of tigers playing with a monkey. He quietly circulated the essence forces in his dantian as, with a fierce expression on his trembling face and an aggressive spirit surrounding him, he slowly walked toward Jiang Yi. He exploded in a loud shout, "Don't lay a finger on my men, if you knew you were going to be frightened about the consequences! Now... it's all too late! However, I, Master Hu, am in a good mood today so I'll give you one chance - we will let you off today, if you crawl between everyone's legs, under all of our groins. How about that?"

source: 江如虎臃肿的身子应声倒飞出去，重重的撞在三四丈外的一个小树上，又被反弹下来，在地上翻滚几圈。
en_us: Jiang Ruhu's obese body responded by flying backwards, crashing heavily into a small tree some thirty or fourty feet away, before recocheting off into the ground, leaving him rolling on the ground for several rounds.

source: 江如虎虽然天资一般，但有个江家大总管的好老子，修炼丹药从不缺，实力可是达到了铸鼎境四重，就算他动用黑色元力怕也很难战胜的。
en_us: Even though Jiang Ruhu's abilities were rather average, his dad was the Jiang Clan’s chief supervisor. Jiang Ruhu never lacked elixirs which could help boost his power up to the fourth stage of the Cast Tripod Realm. Even if Jiang Yi used his black essence force, he would still find it difficult to emerge victorious in a fight.

source: 江如虎被一口鲜血喷中，眼睛顿时睁不开了，他内心一沉，也不攻击了双手交叉护住头部，一边慌忙爆退，一边歇斯底里的大喊：“你们都是死人吗？还不快上？给我打死江逸这个野种！”
en_us: Jiang Ruhu was sprayed by a mouthful of fresh blood and as such, he could not immeidately open his eyes. His heart sank as he chose not to counter-attack but rather hold both his hands to protect his head. As he hurriedly retreated explosively backwards, he hysterically shouted, "Are you guys all dead? Why don't you hurry up and attack? Beat that bastard Jiang Yi to death for me!"

source: 江如虎被打得不成人样抬了回来，引起江家一片哗然，不过听说是马家子弟动的手全都不在意了，反而暗骂江如虎等人废物，丢江家的脸。
en_us: The physically mutilated state that Jiang Ruhu was left in after the fight and in which he had been carried home, triggered an uproar from the rest of the Jiang Clan. However, upon hearing that the injuries were the handiwork of Ma Family members, all the Jiang Clan members stopped minding about the injuries; instead, they secretly scolded Jiang Ruhu and his gang of Jiang Clan descendants for being useless good-for-nothings and losing face for the Jiang Clan.

source: 江如虎要的就是这个效果，如此多人江逸就算再逆天也双拳难敌四手，退一万步说，有这么多人拖延时间，足够等到江如龙的到来。
en_us: This was exactly the result that Jiang Ruhu wanted. No matter how heaven defying Jiang Yi was, he still wouldn't be able to go against that many people. In other words, it also meant that with so many of them stalling for time, Jiang Rulong would definitely be able to arrive on time.

source: 江如虎身边的三人立即惊醒，一直以来他们习惯了听从江如虎的命令，此刻也没有过多的犹豫，元力疯狂运转朝江逸冲去。
en_us: The three people standing next to Jiang Ruhu immediately roused from their stunned condition. They had always been used to obeying Jiang Ruhu's orders; likewise, at that moment they did not hestitate too much, and instead rushed towards Jiang Yi with essence force being circulated like crazy on them.

source: 江如虎那群人也全部懵了，两个多月前在西山，江逸才是铸鼎境二重吧？如此短的时间，他难道吞服了天阶丹药？想到两个多月前，江逸凭借铸鼎境二重都能把他揍得不成人样，江如虎下意识退后了两步。
en_us: Jiang Ruhu and the group all got a stun. Two months ago at the Western Hills, Jiang Yi was just at the second stage of the Cast Tripod Realm right? Such a large progress in such a short amount of time... Could he have consumed a heaven-tier elixir? Thinking back when Jiang Yi was just second stage of the Cast Tripod Realm, he was already beaten into pulp. Jiang Ruhu couldn't help but took two steps back unconsciously.

source: 江如虎！
en_us: Jiang Ruhu!

source: 江如鹰却很快醒悟过来，厉声大喝道：“江逸实力进步如此大，要是给家族知道了，非但不会责怪他，反而会重视他！还说不定会赐予核心子弟的身份，到时候我们就只能一辈子被他欺压了，这仇也没办法报了。虎哥说的没错，这事我们全部要隐瞒下来，就说和马家子弟开战，反正也不是第一次了，等龙哥从武殿内回来，再让龙哥出手……做了江逸！”
en_us: Yet Jiang Ruying very quickly connected the dots. In a stern voice, he shouted aloud, "Jiang Yi's power has improved so greatly - if the Family found out, not only would they not scold him, they might even see him as someone valuable! On top of that, they might even offer him the position as a core descendant of the Family! By that time, we would have no other option but be pushed around and be bullied by him forever, and we would never be able to get revenge for this. What Brother Hu said is right - we would have to keep this whole event as a secret, and say that we have a fight with the sons of the Ma Family. It's not the first time that has happened, after all. We will wait for Brother Long to return from the Martial Arts Hall, and then we will let Brother Long take action... and punish Jiang Yi for his actions!"

source: 江如鹰的身子重重砸落在地，右腿上裤子全部炸裂，满是鲜血的小腿上，森森白骨隐约可见，他整张脸都扭曲了，一股撕心裂肺的痛苦让他抱着右腿长嚎不休。
en_us: Jiang Ruying's body crashed heavily on the ground. His right pants leg had been completely torn to shreds in the explosion. The eerie pale white colour of bone could be vaguely seen on his lower right leg, itself covered in fresh blood. His entire face was distorted in a grimace, as an intensely acute pain radiating from his right leg left him cradling the leg and bawling ceaselessly.

source: 江如鹰眸子一转，快速和众人交代起来对上口供，避免回去之后被发现破绽。众人一边低声交谈，一边快速下了西山朝江家大院奔去。
en_us: Jiang Ruying shifted his pupils as he quickly instructed all the people around him by corroborating through the same matching testimony, to avoid discovering any mistakes or gaps in the story after they return home. While the group of men discussed in a low voice, they hastily left the Western Hills and ran towards the Jiang Residence Central Courtyard.

source: 江如龙不愧是江家年轻一代第二人，如果危险的关头，他单手抓住江如虎一甩，然后单腿在地上一点，身子横跃而起，另外一条腿化作残影朝江逸扫去。
en_us: Jiang Rulong was indeed worthy to be the no.2 of the Jiang Clan's young generation. At this critical moment, he used one hand to grab Jiang Ruhu and tossed him aside, then found his center of gravity by stepping on the ground with a single leg. He leaped back up and kicked at Jiang Yi with his other leg, leaving behind an afterimage.

source: 江如龙吓坏了，身子本来朝一边躲去的，连忙强行扭转身体，如炮弹般朝江如虎射去，最终在江如虎撞到墙壁前硬生生的抓住了他的身体。
en_us: Jiang Rulong got a scare, his body was actually meant to dodge to the side but he managed to twist his body and shot towards Jiang Ruhu like a cannon. He finally caught hold of Jiang Ruhu in time, right before Jiang Ruhu crashed into the wall.

source: 江如龙是铸鼎境七重，如果他能在江如龙出武殿之前，把境界提升到铸鼎境三重到四重，那么未必不可以和他一战了。
en_us: Jiang Rulong had a power level at the seventh stage of the Cast Tripod Realm. If he could increase his power-level up to the third or even fourth stage of the Cast Tripod Realm before Jiang Rulong left the Martial Arts Hall, it was not unlikely that he could fight with Jiang Rulong on a relatively-equal footing.

source: 江如龙暴怒的大吼，脑袋内传来的剧痛，鲜血浸入他的眼睛让他整个人都陷入癫狂之中。他不断的扭曲身子，不断的暴怒大吼，另外一条腿胡乱的乱踢，企图击中江逸，摆脱他的控制。
en_us: Jiang Rulong roared furiously. The intense pain that came from within his head, the blood that soaked his eyes caused him to going into a frenzied state of mind. He continually contorted his body and roared furiously, his other leg randomly kicked in attempt to hit Jiang Yi and rid of his grasp.

source: 江如龙瞬间醒悟过来，江逸刚才不是不小心……而是故意的，这一切都在他算计之中，他此刻抱着江如虎，因为冲得太猛，加上江如虎朝前方的冲力让他重心不稳，战力大打折扣，江逸偷袭的时机把握的太好了……
en_us: Jiang Rulong suddenly come to realize that Jiang Yi wasn't careless... but it was intentional; everything was within his plans. He who was carrying Jiang Ruhu lost his center of gravity due to the himself doing a vigorous dash and coupled with the speed of Jiang Ruhu. He had lost a huge portion of his combat strength and it was now a great opportunity for Jiang Yi to sneak in an attack...

source: 江如龙脸上都是冷汗，但他还来不及擦心里却陡然一凛，他感觉到一股凌冽的杀机锁定了他，他目光猛然一扫却利马一缩，因为一个拳头已经在他眼眸内开始无限放大……
en_us: Jiang Rulong's face was covered in cold sweat. Before he even had time to recover from the shock, he felt a sharp killing intent locking onto him. He turned around for a scan but instead shrank his eyes, because a fist was expanding indefinitely in his sight...

source: 江如龙身高足足有七尺，整整高江逸江逸两个头，身子也魁梧如一头暴熊，他和江如虎不一样，浑身都是虬结的肌肉，方头大耳，光看外表就知道是一名猛汉。
en_us: Jiang Rulong was seven feet tall and was two heads taller than Jiang Yi. His body was that of a violent bear, it was entirely different from plump Jiang Ruhu and was packed with firm muscles. He had a square face and large ears; just from his appearance, it was safe to say that he was a fierce fighter.

source: 江家东院，管事房。
en_us: Jiang Residence Eastern Court, Housekeeping Chamber.

source: 江家子弟很多，直系的有二十多个，旁系的那就更多了，类似江如虎这类旁系子弟足足有上百个，不过真正的优秀天才子弟，肯定不会出现在演武殿。
en_us: The Jiang Clan had many descendants; the direct lineage consisted of more than twenty members while the collateral lineage had even more. There were at least over a hundred collateral lineage descendants like Jiang Ruhu. Those truly prodigious descendants would definitely not be appearing in the Martial Arts Demonstration Hall.

source: 江家年轻一代中身份最尊贵的，自然是拥有各种血缘关系的少爷，其次才是没有血缘关系的普通子弟。其中像大少爷这样的直系血统少爷，以及极少数天资卓越的旁系少爷，无疑是最上层的存在。而江如虎等人，作为旁系少爷而言，天资一般，所以在江家子弟中的地位属于第二等。
en_us: The most respected members of the youngest generation in the Jiang Clan were naturally the sons with blood relations—direct and indirect—to the main Jiang bloodline. Relatives with no blood ties were deemed secondary. As a result, the top echelon was comprised of direct descendants as well as a tiny minority of highly talented relatives from branch families. Those from a branch family and of average ability, like Jiang Ruhu, possessed less status.

source: 江家族规森严，因触犯族规被活活打死的子弟也不在少数，江逸心里想着炼丹房的事情，一时忘记了令牌的事情，但此刻也只能强装镇定，转头惭愧说道：“荣管事，不好意思，我放家里忘记带了……”
en_us: The Jiang Clan rules were strict, and the number of clan members who were beaten to death for breaking these laws was not small. Jiang Yi's mind was focused on the events that happened in the alchemy lab that he had forgotten his issues with the command token. Despite this, at the moment he could only pretend to be calm and composed. Turning his head, he shamefully said, "Chief Rong, I am sorry. I left it at home and forgot to bring it out..."

source: 江家有一门武技叫幻影拳，本质上和这暴雨拳差不多，幻影拳江逸已经感悟到大成的地步了，拳影比这翊凌雪真实多了，此刻翊凌雪又怎么能伤他？
en_us: The Jiang Clan had a martial arts technique called Phantom Punch, which in essence was not much different from this Thunderstorm Fist. Jiang Yi could feel that his mastery of Phantom Punch had hit Phenomenal Stage, with his fist silhouettes being more concrete and realistic that what Yi Lingxue could produce. How could Yi Lingxue possibly harm him at that moment?

source: 江家西山药田种植的主要是一种能够补血的药草，草参。草参是一种九品灵草，虽然品级最低，但好歹挤进了灵药的范畴，这就不是普通百姓消费得起的了。事实上，江家以草参为主要材料制作出来的疗伤药补血丸，主要供给的对象除了家族子弟和外面的武者外，还有就是军队里的军官。
en_us: The main crop being produced in the Western Hills was grass ginseng, a type of spirit herb that could boost and enrich the blood. Winter ferula was a ninth-grade spirit herb—even though this medicinal plant was of the lowest grade in quality, as the plant was considered a type of spirit herb, normal civilians could not afford to purchase this herb. Frankly speaking, the medicine produced by the Jiang Clan used grass ginseng as its primary ingredient. It was used heal wounds and improve blood quality and was mainly provided to descendants of the Jiang Clan, martial artists not within the family, as well as soldiers of the state army.
